Repository: GamemakerChina/GmlSpec-CN
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: This function returns whether a given variable is a real number (single, double or integer) or not.
zh_cn: 此函数返回给定变量是否为实数(single, double or integer)。

source: This function returns whether a given variable is a string number or not.
zh_cn: 此函数返回给定变量是否为字符串数字。

source: This function returns whether a given variable is defined or not.
zh_cn: 此函数返回给定变量是否定义。

source: This function returns whether a given variable is infinity (an infinite number) or not, returning true if it is, and false if it is not.
zh_cn: 此函数返回给定变量是否为无穷大(一个无限的数字)，如果是则返回true，如果不是则返回false。

source: This function returns whether a given variable refers to a matrix or not.
zh_cn: 此函数返回给定变量是否引用矩阵。

source: This function returns whether a number is positive, negative or neither and returns 1, -1, 0 respectively.
zh_cn: 此函数返回一个数字是正数、负数还是两者都不是，并分别返回1、-1、0。

source: This function returns whether a sound exists (true) or not (false).
zh_cn: 此函数返回声音是否存在(true)或不存在(false)。

source: This function returns whether a sprite with the specified index exists or not in the project being run.
zh_cn: 此函数返回具有指定索引的sprite是否存在于正在运行的项目中。

source: This function returns whether an audio emitter exists (true) or not (false).
zh_cn: 此函数返回音频发射器是否存在(真)或不存在(假)。

source: This function returns whether an object with the specified index exists or not.
zh_cn: 此函数返回具有指定索引的对象是否存在。

source: This function returns whether the game window is in fullscreen mode (true) or not (false).
zh_cn: 此函数返回游戏窗口是全屏模式(true)还是非全屏模式(false)。

source: This function returns with what precision the given path has been "smoothed", and will be an integer value from 1 to 8.
zh_cn: 此函数返回给定路径被"平滑"的精度，它将是一个从1到8的整数值。

source: This function sends a chat message.
zh_cn: 此函数发送聊天消息。

source: This function sets a byte directly in a string (based on the UTF8 format) and returns a copy of the string with the changes.
zh_cn: 此函数直接在字符串中设置一个字节(基于UTF8格式)，并返回更改后的字符串副本。

source: This function sets a fixed local input frame delay.
zh_cn: 此函数设置固定的本地输入帧延迟。

source: This function sets a new direction of movement and a new speed to the instance running the code.
zh_cn: 此函数为运行代码的实例设置了新的移动方向和新的速度。

source: This function sets a point in the room to define the shape of a polygon which will be used to create a group of soft body particles.
zh_cn: 此函数在房间中设置一个点来定义多边形的形状，该多边形将用于创建一组软体粒子。

source: This function sets a polygon shape for your fixture, but you will need to use physics_fixture_add_point() to actually define the shape of this polygon relative to the origin of the fixture.
zh_cn: 此函数为您的夹具设置一个多边形形状，但是您将需要使用physics_fixture_add_point()来实际定义该多边形相对于夹具原点的形状。

source: This function sets an extra latency to be added to all sent and received network messages.
zh_cn: 此函数设置了一个额外的等待时间，添加到所有发送和接收的网络消息中。

source: This function sets how many blended copies of the given font can be cached before old ones are overwritten.
zh_cn: 此函数设置在覆盖旧字体之前，可以缓存给定字体的混合副本的数量。

source: This function sets how many blended copies of the given sprite can be cached before old ones are overwritten.
zh_cn: 此函数设置在旧的精灵被覆盖之前，可以缓存多少给定精灵的混合副本。

source: This function sets if the default display of rollback events should be used or not.
zh_cn: 此函数设置是否应该使用回滚事件的默认显示。

source: This function sets the maximum gain (volume) for the sound.
zh_cn: 此函数设置声音的最大增益(音量)。

source: This function sets the seed to a random value.
zh_cn: 此函数将种子设置为一个随机值。

source: This function should always be called when the emitters are no longer needed for the system to prevent memory leaks and errors.
zh_cn: 当系统不再需要发射器时，应该总是调用此函数，以防止内存泄漏和错误。

source: This function should always be called when the given emitter is no longer needed for the system to prevent memory leaks and errors.
zh_cn: 当系统不再需要给定的发射器时，应该总是调用此函数，以防止内存泄漏和错误。

source: This function should always be used when you are finished using the DS grid to prevent memory leaks that can slow down and crash your game.
zh_cn: 当你使用完DS网格时，应该总是使用此函数，以防止内存泄漏，这会导致游戏变慢和崩溃。

source: This function should always be used when you are finished using the DS priority queue to prevent memory leaks that can slow down and crash your game.
zh_cn: 当你使用完DS优先队列时，应该总是使用此函数，以防止内存泄漏，这会导致游戏变慢和崩溃。

source: This function should always be used when you are finished using the DS queue to prevent memory leaks that can slow down and crash your game.
zh_cn: 当你使用完DS队列时，应该使用此函数来防止内存泄漏，因为内存泄漏会降低游戏速度并使游戏崩溃。

source: This function should always be used when you are finished using the DS stack to prevent memory leaks that can slow down and crash your game.
zh_cn: 当你使用完DS堆栈后，应该总是使用此函数来防止内存泄漏，这会导致游戏变慢和崩溃。

source: This function should always be used when you are finished using the ds_list to prevent memory leaks that can slow down and crash your game.
zh_cn: 当你使用完ds_list的时候，应该使用此函数来防止内存泄漏，因为内存泄漏会降低游戏速度并使游戏崩溃。

source: This function should be called the moment you are finished reading or writing to any open ini file.
zh_cn: 当你读完或写完任何打开的ini文件时，应该调用此函数。

source: This function should be used at the start of the game to make sure that the platform running your game has successfully compiled any shaders used (particularly on Windows where some computers may be using DX9 with Shader Level 2.0 and not a later version using shader level 3.0).
zh_cn: 此函数应该在游戏开始时使用，以确保运行你的游戏的平台已经成功编译了任何使用的着色器(特别是在Windows上，一些计算机可能使用DX9着色器级别2.0，而不是使用着色器级别3.0的更高版本)。

source: This function should be used to add sets of key/value pairs into the specified DS map.
zh_cn: 此函数应用于向指定的DS map添加键/值对集。

source: This function should be used whenever a dynamically created sequence is no longer required to free up the memory associated with it.
zh_cn: 当动态创建的序列不再需要释放与其关联的内存时，应该使用此函数。

source: This function should not be used very often as it is extremely slow and may cause a pause in your game.
zh_cn: 此函数不应该经常使用，因为它非常慢，可能会导致游戏暂停。

source: This function simply destroys all instances that are found to be in collision with the specified position.
zh_cn: 此函数只是销毁所有与指定位置碰撞的实例。

source: This function simply returns the height, in pixels, of the indexed surface.
zh_cn: 此函数只返回索引表面的高度(以像素为单位)。

source: This function simply returns the same string repeated a given number of times over itself.
zh_cn: 此函数只是返回重复给定次数的相同字符串。

source: This function simply returns the width, in pixels, of the indexed surface.
zh_cn: 此函数仅返回索引表面的宽度(以像素为单位)。

source: This function simply takes a sprite resource and stretches it over the given width and height so that it occupies that area.
zh_cn: 此函数简单地获取一个sprite资源，并将其拉伸到给定的宽度和高度，这样它就占据了那个区域。

source: This function simply takes a surface and stretches it over the given width and height so that it occupies the area.
zh_cn: 此函数简单地获取一个表面，并将其拉伸到给定的宽度和高度，使其占据该区域。

source: This function simply takes the image from one surface and copies it onto another one at the specified local position within that surface (where the (0,0) position is the top left corner of the destination surface).
zh_cn: 此函数简单地从一个表面获取图像，并将其复制到另一个表面中指定的局部位置(其中(0，0)位置是目标表面的左上角)。

source: This function simply tells the instance running the code to move towards a set point at a set speed.
zh_cn: 此函数只是告诉运行代码的实例以设定的速度向设定的点移动。

source: This function splits string into an ordered list of substrings by searching for the delimiter, puts these substrings into an array, and returns the array.
zh_cn: 此函数通过搜索分隔符将字符串拆分为有序的子字符串列表，将这些子字符串放入数组中，并返回数组。

source: This function splits string into an ordered list of substrings by searching from an array of delimiters, puts these substrings into an array, and returns the array.
zh_cn: 此函数通过从分隔符数组中搜索将字符串拆分为有序的子字符串列表，将这些子字符串放入数组中，并返回数组。

source: This function starts the current game.
zh_cn: 此函数启动当前游戏。

source: This function switches random input for other players in sync test.
zh_cn: 此函数在同步测试中为其他玩家切换随机输入。

source: This function takes a path and copies it into a new path.
zh_cn: 此函数获取一个路径，并将其复制到一个新路径中。

source: This function takes a single character input string and returns the Unicode (UTF8) value for that character.
zh_cn: 此函数接受单个字符输入字符串，并返回该字符的Unicode (UTF8)值。

source: This function takes all the path points and flips them along the horizontal axis.
zh_cn: 此函数获取所有路径点，并沿水平轴翻转它们。

source: This function takes all the path points and mirrors them along the vertical axis.
zh_cn: 此函数取所有的路径点，并沿垂直轴将它们镜像。

source: This function takes any real number and rounds it up to the nearest integer.
zh_cn: 此函数接受任何实数并取四舍五入到最接近的整数。

source: This function takes an array of 16 values, corresponding to a given 4x4 matrix type, where elements [0 - 3] would be row 1, elements [4 -7] would be row 2, etc... (see the image on the main page).
zh_cn: 此函数接受一个16个值的数组，对应于一个给定的4x4矩阵类型，其中元素[0 - 3]将是第一行，元素[4 -7]将是第2行，等等……(见主页图片)。

source: This function takes the filename handle as returned by the function file_bin_open() and then rewrites the file, clearing it of all previous data to start writing from the beginning of the file.
zh_cn: 此函数获取函数file_bin_open()返回的文件名句柄，然后重写文件，清除所有以前的数据，从文件的开头开始写。

source: This function takes the room index (a real number) and not the room name (a string).
zh_cn: 此函数接受房间索引(一个实数)而不是房间名(一个字符串)。

source: This function takes the supplied components of the vector and returns the length (distance) of the vector.
zh_cn: 此函数获取所提供的向量分量，并返回向量的长度(距离)。

source: This function takes two previously created (or included) sprite indexes, and copies the image from one to the other.
zh_cn: 此函数采用两个先前创建的(或包含的)sprite索引，并将图像从一个复制到另一个。

source: This function transforms a vector by a matrix.
zh_cn: 此函数用矩阵变换一个向量。

source: This function translates degrees into radians using the formula:
zh_cn: 此函数使用以下公式将角度转换为弧度:

source: This function translates radians into degrees using the formula:
zh_cn: 此函数使用以下公式将弧度转换为度数:

source: This function uses the instance collision mask (decided by the sprite properties or the mask index of the calling instance) to mark cells as forbidden or not in an MP grid, where forbidden cells cannot be crossed by any of the pathfinding functions.
zh_cn: 此函数使用实例碰撞掩码(由sprite属性或调用实例的掩码索引决定)将MP网格中的单元标记为禁止或不禁止，其中禁止的单元不能被任何寻路函数跨越。

source: This function uses the value/saturation of one sprite and multiplies it with the alpha of the target sprite.
zh_cn: 此函数使用一个精灵的值/饱和度，并将其与目标精灵的alpha相乘。

source: This function was originally designed for calling script assets in a dynamic way, but with the introduction of user-defined functions it can now be used in two ways:
zh_cn: 此函数可用于设置给定的一组图块数据，以将图块旋转90度或不旋转。

source: This function will "mark" (or "flag") a given position within a previously created DS list as holding a DS map.
zh_cn: 此函数将把先前创建的DS列表中的给定位置"mark"(或"flag")为保存DS map。

source: This function will "mark" (or "flag") a given position within a previously created DS list as holding another DS list.
zh_cn: 此函数将把先前创建的DS列表中的给定位置"标记"(或"标志")为持有另一个DS列表。

source: This function will add 2D position data to the vertex currently being defined for the custom primitive.
zh_cn: 此函数将2D位置数据添加到当前为自定义图元定义的顶点。

source: This function will add 3D position data to the vertex currently being defined for the custom primitive.
zh_cn: 此函数将向当前为自定义图元定义的顶点添加3D位置数据。

source: This function will add a floating point value to the vertex data.
zh_cn: 此函数将向顶点数据添加一个浮点值。

source: This function will add a value (real or string) onto the tail of the DS queue.
zh_cn: 此函数将在DS队列的尾部添加一个值(实数或字符串)。

source: This function will add four floating point values to the vertex data.
zh_cn: 此函数将向顶点数据添加四个浮点值。

source: This function will add four unsigned byte values (0 - 255) to the vertex data.
zh_cn: 此函数将向顶点数据添加四个无符号字节值(0 - 255)。

source: This function will add surface normal data to the vertex currently being defined for the custom primitive.
zh_cn: 此函数将把表面法线数据添加到当前为自定义图元定义的顶点。

source: This function will add the data from a buffer into the audio queue that you previously created using the function audio_create_play_queue().
zh_cn: 此函数会将缓冲区中的数据添加到您之前使用函数audio_create_play_queue()创建的音频队列中。

source: This function will add the given value into the list at the given position.
zh_cn: 此函数将给定的值添加到列表的给定位置。

source: This function will add three floating point values to the vertex data.
zh_cn: 此函数将向顶点数据添加三个浮点值。

source: This function will add two floating point values to the vertex data.
zh_cn: 此函数将把两个浮点值加到顶点数据上。

source: This function will affect the relative volume of all sounds and music played from within your game.
zh_cn: 此函数会影响游戏中播放的所有声音和音乐的相对音量。

source: This function will also trigger the Room End event.
zh_cn: 此函数还将触发房间结束(Room End)事件。

source: This function will always return a number between 1 and -1.
zh_cn: 此函数将始终返回一个介于1和-1之间的数字。

source: This function will apply the given camera settings to the current camera view being rendered immediately.
zh_cn: 此函数将给定的相机设置应用到当前正在渲染的相机视图。

source: This function will associate a physics "world" with the room and all instances created in the room will behave using the physics that has been defined for them and the world itself.
zh_cn: 此函数将物理"世界"与房间相关联，在房间中创建的所有实例将使用为它们和世界本身定义的物理行为。

source: This function will attempt to convert a given value into a 64bit integer, where the value must be either a real, a string, an int64, an int32, or a ptr.
zh_cn: 此函数将尝试将给定值转换为64位整数，其中值必须是实数、字符串、int64、int32或ptr。

source: This function will attempt to convert a given value into a boolean data type, where the value will be returned as true if it is greater than 0.5 and false otherwise.
zh_cn: 此函数将尝试将给定值转换为布尔型数据类型，如果该值大于0.5则返回true，否则返回false。

source: This function will attempt to convert a given value into a pointer data type, where the value must be either a real, a string, an int64, an int32, or a ptr.
zh_cn: 此函数将尝试将给定值转换为指针数据类型，其中值必须是实数、字符串、int64、int32或ptr。

source: This function will automatically "wrap" an instance that has left the room on either the horizontal or vertical (or both) axis.
zh_cn: 此函数将自动"包装"在水平或垂直(或两者)轴上离开房间的实例。

source: This function will call the current event of the parent object of the instance.
zh_cn: 此函数将调用实例的父对象的当前事件。

source: This function will check a position for a collision with any instances at the given point, and if there is one, it will change all instances in collision to be instances of the chosen object.
zh_cn: 此函数将检查在给定点与任何实例的碰撞位置，如果有，它会将碰撞中的所有实例更改为所选对象的实例。

source: This function will check a rectangular area that you define to see if it is either not in collision, completely within the destination bounds, or if it is simply touching, a defined circular area.
zh_cn: 此函数将检查您定义的矩形区域，以查看它是否不在碰撞中，是否完全在目标边界内，或者它是否只是接触一个定义的圆形区域。

source: This function will check a rectangular area that you define to see if it is either not in collision, completely within the destination bounds, or if it is simply touching, a defined triangular area.
zh_cn: 此函数将检查您定义的矩形区域，以查看它是否不在碰撞中，是否完全在目标边界内，或者它是否只是接触一个定义的三角形区域。

source: This function will check a shader at run-time to make sure that it has been successfully compiled.
zh_cn: 此函数将在运行时检查着色器，以确保它已成功编译。

source: This function will check a specific audio group to see if it has been loaded into memory, ready for use.
zh_cn: 此函数将检查一个特定的音频组，看它是否已经加载到内存中，准备使用。

source: This function will check all the instances of the given object to see which is furthest from the given x/y point.
zh_cn: 此函数将检查给定对象的所有实例，以查看哪个实例距离给定的 x / y 点最远。

source: This function will check all the instances of the given object to see which is nearest to the given x/y point.
zh_cn: 此函数将检查给定对象的所有实例，看哪个最接近给定的 x / y 点。

source: This function will check the given sound to see if it is currently paused.
zh_cn: 这个函数将检查给定的声音，看它当前是否处于暂停状态。

source: This function will check the given sound to see if it is currently playing.
zh_cn: 此函数将检查给定的声音，看它是否正在播放。

source: This function will check the loading progress for an audio group and return an (approximate) value between 0 and 100.
zh_cn: 此函数将检查音频组的加载进度，并返回一个介于0到100之间的(近似)值。

source: This function will check to see if a given position enters into collision with any instance with a valid collision mask at the given position.
zh_cn: 此函数将检查给定位置是否与在给定位置具有有效碰撞遮罩的任何实例发生碰撞。

source: This function will check two rectangular areas that you define to see if the source rectangle is either not in collision, completely within the destination rectangles bounds, or if they are simply touching.
zh_cn: 此函数将检查您定义的两个矩形区域，以查看源矩形是否没有碰撞，是否完全在目标矩形的边界内，或者它们是否只是相互接触。

source: This function will clear a room of all instances (no destroy events shall be called for the instances that are being removed).
zh_cn: 此函数将清除一个房间中的所有实例(对于正在被移除的实例，不应调用销毁事件)。

source: This function will clear the (previously created) DS map of all key/value pairs, but it will not delete the DS map itself from memory.
zh_cn: 此函数将清除(以前创建的)所有键/值对(key/value)的DS map，但它不会从内存中删除DS map本身。

source: This function will clear the current keyboard and mouse states.
zh_cn: 此函数将清除当前的键盘和鼠标状态。

source: This function will clear the current state of the given mouse button.
zh_cn: 此函数将清除给定鼠标按钮的当前状态。

source: This function will clear the specified animation track of all animations, ready to be re-assigned.
zh_cn: 此函数将清除所有动画的指定动画轨道，以便重新分配。

source: This function will commit a file to the chosen cloud service for storage.
zh_cn: 此函数将提交一个文件到所选的云服务进行存储。

source: This function will commit a string to the chosen cloud service for storage.
zh_cn: 此函数将提交一个字符串到所选的云服务进行存储。

source: This function will convert a string encoded previously using base64 format, into standard text.
zh_cn: 此函数将先前使用base64格式编码的字符串转换为标准文本。

source: This function will convert a string into a base64 format encoded string.
zh_cn: 此函数将字符串转换为base64格式编码的字符串。

source: This function will convert the data from the given buffer into a base64 format encoded string.
zh_cn: 此函数将把来自给定缓冲区的数据转换成base64格式的编码字符串。

source: This function will copy one room to another, removing all instances, tiles etc... from the room that is being copied to and replacing them completely with the new room contents.
zh_cn: 此函数将复制一个房间到另一个房间，删除所有实例，瓷砖等…从被复制到的房间，并完全用新的房间内容替换它们。

source: This function will copy the specified file, giving it the new name that you choose.
zh_cn: 此函数将复制指定的文件，给它一个你选择的新名字。

source: This function will create a DS map and populate it with information for the given listener.
zh_cn: 此函数将创建一个DS map，并用给定的信息填充它。

source: This function will create a custom debug message that is shown in the compiler window at runtime.
zh_cn: 此函数将创建一个定制的调试消息，在运行时显示在编译器窗口中。

source: This function will create a datetime value from the component given as the arguments.
zh_cn: 此函数将从作为参数给出的组件中创建一个日期时间值。

source: This function will create a new camera and then set its view into the room, before return the unique ID value to identify the camera in future function calls.
zh_cn: 此函数将创建一个新的相机，然后将其视图设置到房间中，之后返回唯一的ID值，以便在将来的函数调用中识别该相机。

source: This function will create a new list data-structure and return the index value.
zh_cn: 此函数将创建一个新的列表数据结构并返回索引值。

source: This function will create a new particle system on a given layer.
zh_cn: 此函数将在给定的层上创建一个新的粒子系统。

source: This function will create a new priority queue data-structure and return the index value.
zh_cn: 此函数将创建一个新的优先级队列数据结构并返回索引值。

source: This function will create a new queue data-structure and return the index value.
zh_cn: 此函数将创建一个新的队列数据结构并返回索引值。

source: This function will create a new stack data-structure and return the index value.
zh_cn: 此函数将创建一个新的堆栈数据结构并返回索引值。

source: This function will create a new, empty, room and add it to your game, returning its index to be stored in a variable for all further codes that deal with this room.
zh_cn: 此函数将创建一个新的空房间，并将其添加到游戏中，返回其索引，并将其存储在一个变量中，用于处理该房间的所有后续代码。

source: This function will create a strip image from all the sub-images in a sprite, saving it to disc with the specified filename.
zh_cn: 此函数将从一个sprite中的所有子图像创建一个条形图像，并以指定的文件名保存到磁盘上。

source: This function will create a text file from a string and open it for reading, returning the file "handle" that should be used in all further file function calls to read from this file.
zh_cn: 此函数将从字符串创建一个文本文件，并打开它进行读取，返回文件"句柄"，该句柄应用于从该文件读取的所有后续文件函数调用。

source: This function will create an "empty" camera, ie: a camera with no view or projection settings defined.
zh_cn: 此函数将创建一个"空"相机，即没有定义视图或投影设置的相机。

source: This function will create an empty animation curve struct, ready for you to populate with channel data.
zh_cn: 此函数将创建一个空的动画曲线结构，为您填充通道数据做好准备。

source: This function will create an ini file from a string and open it for reading/writing.
zh_cn: 此函数将从一个字符串创建一个ini文件，并打开它进行读/写。

source: This function will create a DS map and populate it with the position, velocity and orientation values for the given listener.
zh_cn: 此函数将创建一个DS map，并用给定的位置、速度和方向值填充它。

source: This function will create the buffer (as a 1 byte aligned "grow" buffer") and return the unique index for the buffer which should be used in all further function calls.
zh_cn: 此函数将创建缓冲区(作为一个1字节对齐的"grow"缓冲区)，并返回缓冲区的唯一索引，该索引应在所有后续函数调用中使用。

source: This function will creates a directory with the given name in the save area.
zh_cn: 此函数将在保存区域创建一个给定名称的目录。

source: This function will deactivate all instances that are in the room at the moment that the code is run.
zh_cn: 此函数将在代码运行时停用房间中的所有实例。

source: This function will delete a sprite from the game, freeing any memory that was reserved for it.
zh_cn: 此函数将从游戏中删除一个精灵，释放所有为它保留的内存。

source: This function will delete the specified file from the system.
zh_cn: 此函数将从系统中删除指定的文件。

source: This function will dequeue the head value off of the DS queue, removing it from the queue and returning the value to be stored in a variable.
zh_cn: 此函数将使头值从DS队列中出队，从队列中删除它，并返回要存储在变量中的值。

source: This function will destroy the given background element.
zh_cn: 此函数将破坏给定的背景元素。

source: This function will destroy the given layer.
zh_cn: 此函数将破坏给定的层。

source: This function will destroy the given sprite element.
zh_cn: 此函数将破坏给定的精灵元素。

source: This function will destroy the given tile map element.
zh_cn: 此函数将销毁给定的tile map元素。

source: This function will do a check to see if the chosen target platform supports shaders, returning true if they do, and false if they do not.
zh_cn: 此函数将检查所选的目标平台是否支持着色器，如果支持则返回true，如果不支持则返回false。

source: This function will draw a part of the chosen sprite at the given position following the same rules as per draw_sprite_part(), only now you can scale the part, blend a colour with it, or change its alpha when drawing it to the screen (the same as when drawing a sprite with draw_sprite_ext()).
zh_cn: 此函数将根据draw_sprite_part()的相同规则在给定位置绘制所选精灵的一部分，只是现在你可以缩放该部分，与之混合颜色，或在将其绘制到屏幕时更改其alpha值(与使用draw_sprite_ext()绘制精灵时相同)。

source: This function will draw a part of the chosen surface at the given position following the same rules as per draw_surface_part(), only now you can scale the part, blend a colour with it, or change its alpha when drawing it to the screen (the same as when drawing a surface with draw_surface_ext()).
zh_cn: 此函数将按照与 draw_surface_part() 相同的规则在给定位置绘制所选表面的一部分，只是现在您可以缩放该部分，与它混合颜色，或在将其绘制到屏幕时更改其 alpha（ 与使用 draw_surface_ext()) 绘制表面时相同。

source: This function will draw a representation of the physics world system of the room to help with debugging when you are having trouble getting the physics scene to work right.
zh_cn: 此函数将绘制一个房间的物理世界系统的表示，当你在让物理场景正常工作时有困难时，可以帮助你进行调试。

source: This function will draw a sprite at the position of all the particles that share the same user defined category value, and that have flags which coincide with those set for the mask.
zh_cn: 此函数将在所有粒子的位置绘制一个精灵，这些粒子共享相同的用户定义的类别值，并且具有与为遮罩设置的标志一致的标志。

source: This function will draw a very simple, rectangular "button" using the currently selected draw colour and alpha where the up argument defines how the beveled edge effect looks, as shown in the image below:
zh_cn: 此函数将使用当前选择的绘制颜色和alpha绘制一个非常简单的矩形"按钮"，其中up参数定义了斜边效果的外观，如下图所示:

source: This function will draw an arrow from point (x1,y1) to point (x2,y2).
zh_cn: 此函数将从点(x1,y1)到点(x2,y2)画一个箭头。

source: This function will draw text in a similar way to draw_text() only now you can choose the colours to use for colouring the text as well as the alpha value, and these new values will be used instead of the base drawing colour and alpha.
zh_cn: 此函数将以类似于draw_text()的方式绘制文本，只是现在您可以选择用于为文本着色的颜色以及alpha值，这些新值将用来代替基本的绘制颜色和alpha值。
